Revit 2027 API
ColorFillScheme.GetEntries Method
 Retrieves copies of all entries.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ColorFillSchemeEntry> GetEntries()
Public Function GetEntries As IList(Of ColorFillSchemeEntry)
public:
IList<ColorFillSchemeEntry^>^ GetEntries()
member GetEntries : unit -> IList<ColorFillSchemeEntry>
Return Value
IList<ColorFillSchemeEntry>
Remarks
 This method recalculates entries based on the current parameter values of the elements colored by the scheme.
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace